RECORD_04-20-25_8.45.30_PM-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: RECORD 04-20-25 8.45.30 PM-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: RECORD 04-20-25 8.45.30 PM-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  RECORD 04-20-25 8.45.30 PM-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(500,649)
      - go(https://www.simplilearn.com/)
      - waitForByCSS(li.item_list.slide_itemhome-university-program-banner-new_1.active_slide > div.banner_info > div.container,Clickable): 10s
      - clickByCSS(li.item_list.slide_itemhome-university-program-banner-new_1.active_slide > div.banner_info > div.container)
      - waitForByCSS(span.courses-mega-menu > span,Clickable): 10s
      - clickByCSS(span.courses-mega-menu > span)
      - 'waitForByCSS(.mega-menu-category > ul:nth-of-type(1) > li:nth-of-type(2),Clickable)': 10s
      - 'clickByCSS(.mega-menu-category > ul:nth-of-type(1) > li:nth-of-type(2))'
      - 'waitForByCSS(.category-list > li:nth-of-type(7),Clickable)': 10s
      - 'clickByCSS(.category-list > li:nth-of-type(7))'
      - waitForByCSS(h2.menu-heading,Clickable): 10s
      - clickByCSS(h2.menu-heading)
      - waitForByCSS(li.menu-list,Clickable): 10s
      - clickByCSS(li.menu-list)

  RECORD 04-20-25 8.45.30 PM-Http:
    headers:
      sec-ch-ua: '"Google Chrome";v="135", "Not-A.Brand";v="8", "Chromium";v="135"'
      sec-ch-ua-mobile: '?0'
      sec-ch-ua-platform: '"Windows"'
      Upgrade-Insecure-Requests: '1'
      User-Agent: >-
        Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML,
        like Gecko) Chrome/135.0.0.0 Safari/537.36
      Accept: >-
        text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
      X-Browser-Channel: stable
      X-Browser-Year: '2025'
      X-Browser-Validation: GN89Pm3qNoE4Gva8lUvpibT2MUc=
      X-Browser-Copyright: Copyright 2025 Google LLC. All rights reserved.
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: https://td.doubleclick.net/td/rul/866563032
            method: GET
            label: https://td.doubleclick.net/td/rul/866563032
            headers: {}
            body:
              random: '1745164888437'
              cv: '11'
              fst: '1745164888437'
              fmt: '3'
              bg: ffffff
              guid: 'ON'
              async: '1'
              gtm: 45be54g3v9119647210z86481802za201zb6481802
              gcd: 13t3t3l3l5l1
              dma: '0'
              tag_exp: >-
                102803279~102813109~102887800~102926062~103027016~103051953~103055465~103077950~103106314~103106316
              ptag_exp: >-
                101509156~102803279~102813109~102887800~102926062~103027016~103051953~103055465~103077950~103106314~103106316
              u_w: '1366'
              u_h: '768'
              url: https://www.simplilearn.com/
              hn: www.googleadservices.com
              frm: '0'
              tiba: Simplilearn | Online Courses - Bootcamp & Certification Platform
              npa: '0'
              pscdl: label_only_2
              auid: '1524496095.1745161805'
              uaa: x86
              uab: '64'
              uafvl: >-
                Google%20Chrome;135.0.7049.96|Not-A.Brand;8.0.0.0|Chromium;135.0.7049.96
              uamb: '0'
              uam: ''
              uap: Windows
              uapv: 10.0.0
              uaw: '0'
              fledge: '1'
              _tu: Cg
              data: edu_pid=1;edu_plocid=Online;edu_pagetype=other;edu_totalvalue=0